stm32-hotspot/X-CUBE-MATTER-Extension/Utilities/trace/manager/stm32_trace_mng.c
/*******************************************************************************
  * @file    stm32_trace_mng.c
  * @author  MCD Application Team
  * @brief   This file contains the trace manager utility functions.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "utilities_conf.h"
#include "stm32_trace_mng.h"

/**
  * @addtogroup TRACE_MNG
  * @{
  */

/* Private defines -----------------------------------------------------------*/
/**
  * @defgroup TRACE_MNG_Private_defines TRACE_MNG Privates defines
  *  @{
  */

/**
  *  @brief  default definition of the max number of application channel managed
  */
#ifndef UTIL_TRACE_MNG_MAXAPPLICATIONCHANNEL
#define UTIL_TRACE_MNG_MAXAPPLICATIONCHANNEL 254
#elif UTIL_TRACE_MNG_MAXAPPLICATIONCHANNEL > 254
#error "the maximum number of application channel is 254"
#endif /* UTIL_TRACE_MNG_MAXAPPLICATIONCHANNEL */

/**
  *  @brief  Number of channel including channel 0
  */
#define TRACE_MNG_MAXCHANNEL (UTIL_TRACE_MNG_MAXAPPLICATIONCHANNEL + 1)


/**
  *  @brief  maximum data length of a command
  */
#define MAX_COMMAND_LENGTH       10

/**
  *  @brief  the control channel id
  */
#define CHANNEL_CONTROL          0

/**
  *  @brief  FOF identifier used to start/end a frame
  */
#define FOF            0x7Eu

/**
  *  @brief  ESC identifier used to escape a frame value
  */
#define ESC            0x7Du

/**
  *  @brief  FOF_VAL identifier used to replace FOF value
  */
#define FOF_VAL        0x5Eu

/**
  *  @brief  ESC_VAL identifier used to replace ESC value
  */
#define ESC_VAL        0x5Du

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/**
  *  @defgroup TRACE_MNG_Private_macros TRACE_MNG Privates macros
  *  @{
  */

/**
  *  @brief  Macro to write data without control inside the FIFO buffer
  */
#define TRACE_MNG_WDATA(_DATA_)  do {                                      \
                                      ptr[writepos] = (_DATA_);            \
                                      writepos = (writepos + 1) % fifosize;\
                                    } while(0);

/**
  *  @brief  Macro to write FOF data inside the FIFO
  */
#define TRACE_MNG_WDATAFOF()     do {                       \
                                      TRACE_MNG_WDATA(FOF); \
                                    } while(0);

/**
  *  @brief  Macro to write 8_bit data with control inside the FIFO
  */
#define TRACE_MNG_WDATAINT8(_DATA_)  \
  do {                               \
    if (FOF == (_DATA_))             \
    {                                \
      TRACE_MNG_WDATA(ESC);          \
      TRACE_MNG_WDATA(FOF_VAL);      \
    }                                \
    else if (ESC == (_DATA_))        \
    {                                \
      TRACE_MNG_WDATA(ESC);          \
      TRACE_MNG_WDATA(ESC_VAL);      \
    }                                \
    else                             \
    {                                \
      TRACE_MNG_WDATA(_DATA_);       \
    }                                \
  } while(0);

/**
  *  @brief  Macro to write 16_bit data inside the FIFO
  */
#define TRACE_MNG_WDATAINT16(_DATA_)            \
  do {                                          \
    TRACE_MNG_WDATAINT8((_DATA_ & 0xFF));       \
    TRACE_MNG_WDATAINT8(((_DATA_ >> 8) & 0xFF));\
  } while(0);

/**
  *  @brief  Macro to write 32_bit data inside the FIFO
  */
#define TRACE_MNG_WDATAINT32(_DATA_)            \
  do {                                          \
    TRACE_MNG_WDATAINT8((_DATA_ & 0xFF));       \
    TRACE_MNG_WDATAINT8(((_DATA_ >> 8) & 0xFF));\
    TRACE_MNG_WDATAINT8(((_DATA_ >>16) & 0xFF));\
    TRACE_MNG_WDATAINT8(((_DATA_ >>24) & 0xFF));\
  } while(0);

/**
  * @}
  */

/* Private enum --------------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/
/**
  * @defgroup TRACE_MNG_private_typedef TRACE_MNG private typedef
  * @{
  */

/**
  * @brief list of the command for channel 0
  * @note : the command could not have the value FOF, ESC
  */
typedef enum
{
  COMMAND_GETAPPCHANNELINFO    = 0x01U, /*!< command to get the application info of the channel */
  COMMAND_SETCHANNELVERBOSE    = 0x02U, /*!< command to set the application info of the channel */
  COMMAND_GETCHANNELINFO       = 0x03U, /*!< command to get the channel info : registered/available */
  COMMAND_CHREGISTRATION       = 0x05U, /*!< command to send registration info */
  COMMAND_RESET                = 0x06U, /*!< command to send reset */
  COMMAND_OVERFLOW             = 0x08U, /*!< command to send an overflow */
  COMMAND_INFORM_STATEVERBOSE  = 0x09U, /*!< command to inform tools on the change of the state verbose value */
  COMMAND_ACK                  = 0xFFU, /*!< command to send an ACK */
  COMMAND_NAK                  = 0xFEU, /*!< command to send an NAK */
  COMMAND_NONE                 = 0x00U  /*!< reserved command */
} TRACE_MNG_Command_t;

/**
  * @brief TRACE_MNG_RXStateMachine_t
  * define the state of the machine to manage the reception
  */
typedef enum
{
  FRAME_WAIT_FOF,
  FRAME_WAIT_CHANNEL,
  FRAME_WAIT_DATA_SIZE,
  FRAME_DATA_RECEPTION,
  FRAME_WAIT_END_FOF,
} TRACE_MNG_RXStateMachine_t;

/**
  *  @brief TRACE_MNG_ApplicationInfo_t.
  *  this structure contains all the data to handle the trace manager context.
  *  @note any move inside the structure definition will impact the command formating
  */
typedef union
{
  uint16_t Val;                 /*!< all application info                     */
  struct
  {
    uint16_t Verbose:6;         /*!< Current application verbose level        */
    uint16_t State:2;           /*!< current state of the application channel */
    uint16_t Instance:5;        /*!< Instance value                           */
    uint16_t Core:3;            /*!< Core value                               */
  } Data;                       /*!< Used to set or get a data value          */
  struct
  {
    uint16_t State_Verbose:8;   /*!< verbose + state application info         */
    uint16_t Core_Instance:8;   /*!< core + instance application info         */
  } Command;                    /*!< Used in command mode                     */
} TRACE_MNG_ApplicationInfo_t;

/**
  *  @brief  TRACE_MNG_ChannelInfo_t channel information.
  */
typedef struct
{
  void (*RXCallback)(uint8_t, UTIL_TRACE_MNG_RxStatus_t);   /*!<function ptr to transfer rx data */
  uint32_t *ApplicationID;                                  /*!<Application ID of the channel    */
  TRACE_MNG_ApplicationInfo_t ApplicationInfo;                /*!<Application information          */
  uint16_t ApplicationVersion;                              /*!<Application version              */
} TRACE_MNG_ChannelInfo_t;

/**
  *  @brief  TRACE_MNG_Context.
  *  this structure contains all the data to handle the trace manager context.
  */
typedef struct
{
  TRACE_MNG_ChannelInfo_t ChannelCtx[TRACE_MNG_MAXCHANNEL];     /*!<this variable contains the information about all the applications */
  uint8_t NumberOfRegisteredChannel;                            /*!<this variable contains the number of registered application */
  void (*currentRXCallback)(uint8_t, UTIL_TRACE_MNG_RxStatus_t);/*!<this variable contains the current callback receiving data  */
} TRACE_MNG_Context_t;

/**
  *  @}
  */

/* Private variables ---------------------------------------------------------*/
/**
  * @defgroup TRACE_MNG_private_variable TRACE_MNG private variable
  * @{
  */

/**
  *  @brief  TRACE_MNG_Ctx
  *  this variable contains all the internal data of the advanced trace system.
  */
TRACE_MNG_Context_t TRACE_MNG_Ctx;

/**
  * @}
  */

