stm32-hotspot/X-CUBE-MATTER-Extension/Utilities/trace/manager/stm32_trace_mng.c
/* Private function prototypes -----------------------------------------------*/
/**
  * @defgroup TRACE_MNG_transport_function TRACE_MNG transport function
  * @{
  */
UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_TransportInit(void);
UTIL_TRACE_MNG_Status_t UTIL_ADV_TRACE_TransportSetRxCallback(void (*UserCallback)(uint8_t *PData, uint16_t Size, uint8_t Error));
UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_TransportAllocateBuffer(uint16_t Size, uint8_t **pData, uint16_t *FifoSize, uint16_t *WritePos);
/**
  * @}
  */

/**
  * @defgroup TRACE_MNG_private_function TRACE_MNG private function
  * @{
  */
static void TRACE_MNG_ExecuterCommand(uint8_t *Data, uint8_t Size);
static void TRACE_MNG_Channel0Responder(uint8_t Data, UTIL_TRACE_MNG_RxStatus_t Status);
static void TRACE_NMG_RXCallback(uint8_t *PData, uint16_t Size, uint8_t Error);
static uint8_t TRACE_MNG_GetINT8Size(uint8_t val);
static uint8_t TRACE_MNG_GetINT16Size(uint16_t val);
static uint8_t TRACE_MNG_GetINT32Size(uint32_t val);
static void TRACE_MNG_SendCommand(uint8_t Command, uint8_t CommandOrigin, uint8_t *PtrData, uint8_t DSize);
static uint8_t TRACE_MNG_Format_ChannelInfo(uint8_t Channel, uint8_t *pData);
static uint8_t TRACE_MNG_ControlTraceCondition(uint8_t Channel, uint8_t VerboseLevel);
static void TRACE_MNG_COMMANDOverFlow(uint8_t **PData, uint16_t *Size);
uint32_t UTIL_TRACE_MNG_GetTimeStamp(void);

/**
  * @}
  */

/* Functions Definition ------------------------------------------------------*/
/**
  * @addtogroup TRACE_MNG_exported_function
  * @{
  */
UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_Init(void)
{
  /* Initialize the advanced trace module */
  UTIL_TRACE_MNG_Status_t retr = UTIL_TRACE_MNG_TransportInit();

  /* initialize the Ptr for Read/Write */
  (void)UTIL_TRACE_MNG_MEMSET8(&TRACE_MNG_Ctx, 0x0, sizeof(TRACE_MNG_Context_t));

  /* Channel zero is enabled by default, channel 0 disabled means no trace */
  TRACE_MNG_Ctx.ChannelCtx[0].RXCallback = TRACE_MNG_Channel0Responder;
  TRACE_MNG_Ctx.ChannelCtx[0].ApplicationInfo.Data.State  = TRACE_MNG_CHANNELSTATE_STATE_DISABLED;

  /* Start the RX reception */
  UTIL_ADV_TRACE_TransportSetRxCallback(TRACE_NMG_RXCallback);

  if (UTIL_TRACE_MNG_OK == retr)
  {
    /* Send the command Reset to indicate an application reset */
    TRACE_MNG_SendCommand(COMMAND_RESET, 0, NULL, 0u);
  }

  UTIL_ADV_TRACE_RegisterOverRunFunction(TRACE_MNG_COMMANDOverFlow);
  return retr;
}

UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_DeInit(void)
{
  UTIL_TRACE_MNG_Status_t retr = UTIL_TRACE_MNG_OK;
  /* Un-initialize the Low Level interface */
  if (UTIL_ADV_TRACE_OK != UTIL_ADV_TRACE_DeInit())
  {
    retr = UTIL_TRACE_MNG_ERR;
  }
  return retr;
}

uint8_t UTIL_TRACE_MNG_RegisterApplication(uint32_t *const AppID, uint16_t AppVersionNumber, uint8_t Core,
                                           uint8_t Instance,
                                           void (*RXCallback)(uint8_t PData, UTIL_TRACE_MNG_RxStatus_t Status))
{
  uint8_t retr = 0;
  uint8_t pdata[22];
  for (uint8_t index = 1; index < TRACE_MNG_MAXCHANNEL; index++)
  {
    /* check of the buffer is empty */
    if (((TRACE_MNG_Ctx.ChannelCtx[index].ApplicationID == AppID) &&
         (TRACE_MNG_Ctx.ChannelCtx[index].ApplicationInfo.Data.Instance == Instance) &&
         (TRACE_MNG_Ctx.ChannelCtx[index].ApplicationInfo.Data.Core == Core)) ||
        TRACE_MNG_Ctx.ChannelCtx[index].ApplicationID == NULL)
    {
      TRACE_MNG_Ctx.ChannelCtx[index].ApplicationID = AppID;
      TRACE_MNG_Ctx.ChannelCtx[index].ApplicationInfo.Data.State = TRACE_MNG_CHANNELSTATE_STATE_ENABLED;
      TRACE_MNG_Ctx.ChannelCtx[index].ApplicationInfo.Data.Verbose = 0;
      TRACE_MNG_Ctx.ChannelCtx[index].ApplicationInfo.Data.Core = Core;
      TRACE_MNG_Ctx.ChannelCtx[index].ApplicationInfo.Data.Instance = Instance;
      TRACE_MNG_Ctx.ChannelCtx[index].ApplicationVersion = AppVersionNumber;
      TRACE_MNG_Ctx.ChannelCtx[index].RXCallback = RXCallback;
      TRACE_MNG_Ctx.NumberOfRegisteredChannel++;

      TRACE_MNG_SendCommand(COMMAND_CHREGISTRATION, 0, pdata, TRACE_MNG_Format_ChannelInfo(index, pdata));
      retr = index;
      break;
    }
  }
  return retr;
}

UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_SetChannelState(uint8_t Channel, UTIL_TRACE_MNG_ChannelState_t State,
                                                       uint8_t VerboseLevel)
{
  UTIL_TRACE_MNG_Status_t retr = UTIL_TRACE_MNG_RESETNOTALLOWED;

  if (Channel < TRACE_MNG_MAXCHANNEL)
  {
    switch (TRACE_MNG_Ctx.ChannelCtx[Channel].ApplicationInfo.Data.State)
    {
      case TRACE_MNG_CHANNELSTATE_STATE_ENABLED:
      case TRACE_MNG_CHANNELSTATE_STATE_DISABLED:
      {
        if (TRACE_MNG_CHANNELSTATE_RESET != State)
        {
          uint8_t data_command[2];
          /* set the state of the Verbose */
          TRACE_MNG_Ctx.ChannelCtx[Channel].ApplicationInfo.Data.Verbose = VerboseLevel;
          TRACE_MNG_Ctx.ChannelCtx[Channel].ApplicationInfo.Data.State = State;
          retr = UTIL_TRACE_MNG_OK;
          data_command[0] = Channel;
          data_command[1] = TRACE_MNG_Ctx.ChannelCtx[Channel].ApplicationInfo.Command.State_Verbose;
          /* Inform PC tools about the state/verbose update */
          TRACE_MNG_SendCommand(COMMAND_INFORM_STATEVERBOSE, 0, data_command, 2);
        }
        break;
      }
      default:
      {
        break;
      }
    }
  }
  else
  {
    retr = UTIL_TRACE_MNG_CHANNELNUMBERERROR;
  }
  return retr;
}

UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_Decoder_IDStringVerbose(uint8_t Channel, uint8_t VerboseLevel, uint16_t IDString)
{

  UTIL_TRACE_MNG_Status_t retr = UTIL_TRACE_MNG_OK;
  uint32_t size = 2;
  uint32_t timeStampVal = UTIL_TRACE_MNG_GetTimeStamp();
  uint8_t *ptr = NULL;
  uint16_t fifosize;
  uint16_t writepos;

  if (TRACE_MNG_ControlTraceCondition(Channel, VerboseLevel) == 1)
  {
    size += TRACE_MNG_GetINT32Size(timeStampVal);
    size += TRACE_MNG_GetINT8Size(Channel);
    size += 2; /* corresponding to TRACE_MNG_GetTimeDecoderSize(DECODER_ID_STRING);*/

    /* Calculate the Frame Size */
    if (IDString > 0xFFu)
    {
      size += TRACE_MNG_GetINT16Size((uint16_t) IDString);
    }
    else
    {
      size += TRACE_MNG_GetINT8Size((uint8_t) IDString);
    }

    /* Allocate the data buffer */
    if ((UTIL_TRACE_MNG_OK == UTIL_TRACE_MNG_TransportAllocateBuffer(size, &ptr, &fifosize, &writepos)) && (0 != fifosize))
    {
      /* Push FOF */
      TRACE_MNG_WDATAFOF();
      /* Push timestamp */
      TRACE_MNG_WDATAINT32(timeStampVal);
      /* Push channel */
      TRACE_MNG_WDATAINT8(Channel);
      /* Push decoder */
      TRACE_MNG_WDATAINT16(DECODER_ID_STRING);

      if (IDString > 0xFFu)
      {
        TRACE_MNG_WDATAINT16(IDString);
      }
      else
      {
        TRACE_MNG_WDATAINT8(IDString);
      }

      /* Push FOF */
      TRACE_MNG_WDATAFOF();

