stm32-hotspot/X-CUBE-MATTER-Extension/Utilities/trace/manager/stm32_trace_mng.c
      /* Validate the data send */
      UTIL_ADV_TRACE_ZCSend_Finalize();
    }
    else
    {
      /* not enough space in the memory */
      retr = UTIL_TRACE_MNG_MEMFULL;
    }
  }
  else
  {
    /* Channel disabled/Reset or mismatch with verbose level */
    retr = UTIL_TRACE_MNG_CHANNELDISABLED;
  }
  return retr;
}

UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_Decoder_IDString(uint8_t Channel, uint16_t IDString)
{
  return UTIL_TRACE_MNG_Decoder_IDStringVerbose(Channel, 0, IDString);
}

UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_Decoder_StringVerbose(uint8_t Channel, uint8_t VerboseLevel,
                                                             uint8_t StringLen, const uint8_t *String)
{

  UTIL_TRACE_MNG_Status_t retr = UTIL_TRACE_MNG_OK;
  uint32_t size = 4; /* 2 FOF + DecoderID */
  uint32_t timeStampVal = UTIL_TRACE_MNG_GetTimeStamp();
  uint8_t *ptr = NULL;
  uint16_t fifosize;
  uint16_t writepos;

  if (TRACE_MNG_ControlTraceCondition(Channel, VerboseLevel) == 1)
  {
    /* Calculate the Frame Size */
    size += TRACE_MNG_GetINT32Size(timeStampVal);
    size += TRACE_MNG_GetINT8Size(Channel);
    size += TRACE_MNG_GetINT8Size(StringLen);

    for (uint8_t index = 0; index < StringLen; index++)
    {
      size += TRACE_MNG_GetINT8Size(String[index]);
    }

    /* Allocate the data buffer */
    if ((UTIL_TRACE_MNG_OK == UTIL_TRACE_MNG_TransportAllocateBuffer(size, &ptr, &fifosize, &writepos)) && (0 != fifosize))
    {
      /* Push FOF */
      TRACE_MNG_WDATAFOF();
      /* Push timestamp */
      TRACE_MNG_WDATAINT32(timeStampVal);
      /* Push channel */
      TRACE_MNG_WDATAINT8(Channel);
      /* Push decoder */
      TRACE_MNG_WDATAINT16(DECODER_STRING);
      /* Push the string length */
      TRACE_MNG_WDATAINT8(StringLen);
      for (uint8_t index = 0; index < StringLen; index++)
      {
        TRACE_MNG_WDATAINT8(String[index]);
      }
      /* Push FOF */
      TRACE_MNG_WDATAFOF();
      /* Validate the data send */
      UTIL_ADV_TRACE_ZCSend_Finalize();
    }
    else
    {
      /* not enough space in the memory */
      retr = UTIL_TRACE_MNG_MEMFULL;
    }
  }
  else
  {
    /* Channel disabled/Reset or mismatch with verbose level */
    retr = UTIL_TRACE_MNG_CHANNELDISABLED;
  }
  return retr;
}

UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_Decoder_String(uint8_t Channel, uint8_t StringLen, const uint8_t *String)
{
  return UTIL_TRACE_MNG_Decoder_StringVerbose(Channel, 0, StringLen, String);
}

UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_Decoder_VariableVerbose(uint8_t Channel, uint8_t VerboseLevel, uint16_t Decoder,
                                                               uint16_t IDString, uint8_t VarSize, const void *Varptr)
{
  UTIL_TRACE_MNG_Status_t retr = UTIL_TRACE_MNG_OK;
  uint32_t size = 2; /* 2 FOF */
  uint32_t timeStampVal = UTIL_TRACE_MNG_GetTimeStamp();
  uint8_t *ptr = NULL;
  uint16_t fifosize;
  uint16_t writepos;

  if ((TRACE_MNG_ControlTraceCondition(Channel, VerboseLevel) == 1) &&
      ((Decoder >= DECODER_VARIABLE_DEC) && (Decoder <= DECODER_VARIABLE_DEC_SIGNED))
     )
  {
    /* Calculate the Frame Size */
    size += TRACE_MNG_GetINT32Size(timeStampVal);
    size += TRACE_MNG_GetINT8Size(Channel);
    size += 2; /* corresponding to TRACE_MNG_GetTimeDecoderSize(Decoder);*/
    size += TRACE_MNG_GetINT16Size(IDString);
    size += TRACE_MNG_GetINT8Size(VarSize);

    for (uint8_t index = 0; index < VarSize; index++)
    {
      size += TRACE_MNG_GetINT8Size(((uint8_t *)Varptr)[index]);
    }

    /* Allocate the data buffer */
    if ((UTIL_TRACE_MNG_OK == UTIL_TRACE_MNG_TransportAllocateBuffer(size, &ptr, &fifosize, &writepos)) && (0 != fifosize))
    {
      /* Push FOF */
      TRACE_MNG_WDATAFOF();
      /* Push timestamp */
      TRACE_MNG_WDATAINT32(timeStampVal);
      /* Push channel */
      TRACE_MNG_WDATAINT8(Channel);
      /* Push decoder */
      TRACE_MNG_WDATAINT16(Decoder);
      /* Push ID String */
      TRACE_MNG_WDATAINT16(IDString);
      /* Push datasize */
      TRACE_MNG_WDATAINT8(VarSize);
      for (uint8_t index = 0; index < VarSize; index++)
      {
        TRACE_MNG_WDATAINT8(((uint8_t *)Varptr)[index]);
      }
      /* Push FOF */
      TRACE_MNG_WDATAFOF();

      /* Validate the data send */
      UTIL_ADV_TRACE_ZCSend_Finalize();
    }
    else
    {
      /* not enough space in the memory */
      retr = UTIL_TRACE_MNG_MEMFULL;
    }
  }
  else
  {
    /* Channel disabled/Reset or mismatch with verbose level */
    retr = UTIL_TRACE_MNG_CHANNELDISABLED;
  }
  return retr;
}

UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_Decoder_VaraibleDECVerbose(uint8_t Channel, uint8_t VerboseLevel,
                                                                  uint16_t IDString, uint8_t VarSize,
                                                                  const void *Varptr)
{
  /* used the decoder DEC */
  return UTIL_TRACE_MNG_Decoder_VariableVerbose(Channel, VerboseLevel, DECODER_VARIABLE_DEC, IDString, VarSize, Varptr);
}

UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_Decoder_VaraibleDEC(uint8_t Channel, uint16_t IDString, uint8_t VarSize,
                                                           const void *Varptr)
{
  /* used the decoder DEC */
  return UTIL_TRACE_MNG_Decoder_VariableVerbose(Channel, 0, DECODER_VARIABLE_DEC, IDString, VarSize, Varptr);
}

UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_Decoder_VaraibleDEC_SIGNEDVerbose(uint8_t Channel, uint8_t VerboseLevel,
                                                                         uint16_t IDString, uint8_t VarSize,
                                                                         const void *Varptr)
{
  /* used the decoder DEC_SIGNED */
  return UTIL_TRACE_MNG_Decoder_VariableVerbose(Channel, VerboseLevel, DECODER_VARIABLE_DEC_SIGNED, IDString, VarSize,
                                                Varptr);
}

UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_Decoder_VaraibleDEC_SIGNED(uint8_t Channel, uint16_t IDString, uint8_t VarSize,
                                                                  const void *Varptr)
{
  /* used the decoder DEC_SIGNED */
  return UTIL_TRACE_MNG_Decoder_VariableVerbose(Channel, 0, DECODER_VARIABLE_DEC_SIGNED, IDString, VarSize, Varptr);
}

UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_Decoder_VaraibleHEXVerbose(uint8_t Channel, uint8_t VerboseLevel,
                                                                  uint16_t IDString, uint8_t VarSize,
                                                                  const void *Varptr)
{
  /* used the decoder HEX */
  return UTIL_TRACE_MNG_Decoder_VariableVerbose(Channel, VerboseLevel, DECODER_VARIABLE_HEX, IDString, VarSize, Varptr);
}

UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_Decoder_VaraibleHEX(uint8_t Channel, uint16_t IDString,
                                                           uint8_t VarSize, const void *Varptr)
{
  /* used the decoder HEX */
  return UTIL_TRACE_MNG_Decoder_VariableVerbose(Channel, 0, DECODER_VARIABLE_HEX, IDString, VarSize, Varptr);
}

UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_Decoder_VaraibleBINVerbose(uint8_t Channel, uint8_t VerboseLevel,
                                                                  uint16_t IDString, uint8_t VarSize,
                                                                  const void *Varptr)
{
  /* used the decoder BIN */
  return UTIL_TRACE_MNG_Decoder_VariableVerbose(Channel, VerboseLevel, DECODER_VARIABLE_BIN, IDString, VarSize, Varptr);
}

UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_Decoder_VaraibleBIN(uint8_t Channel, uint16_t IDString, uint8_t VarSize,
                                                           const void *Varptr)
{
  /* used the decoder BIN */
  return UTIL_TRACE_MNG_Decoder_VariableVerbose(Channel, 0, DECODER_VARIABLE_BIN, IDString, VarSize, Varptr);
}

/**
  * @}
  */

/**
  * @addtogroup TRACE_MNG_transport_function
  * @{
  */

/**
  * @brief Initialize the transport layer
  * @retval status based on @ref UTIL_TRACE_MNG_Status_t
  */
__WEAK UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_TransportInit(void)
{
  UTIL_TRACE_MNG_Status_t retr = UTIL_TRACE_MNG_OK;
  if (UTIL_ADV_TRACE_OK != UTIL_ADV_TRACE_Init())
  {
    retr = UTIL_TRACE_MNG_TRANSPORTERROR;
  }
  return retr;
}

/**
  * @brief set the reception callback of the transport layer
  * @retval status based on @ref UTIL_TRACE_MNG_Status_t
  */
__WEAK UTIL_TRACE_MNG_Status_t UTIL_ADV_TRACE_TransportSetRxCallback(void (*UserCallback)(uint8_t *PData,
                                                                           uint16_t Size, uint8_t Error))
{
  UTIL_TRACE_MNG_Status_t retr = UTIL_TRACE_MNG_OK;
  if (UTIL_ADV_TRACE_OK != UTIL_ADV_TRACE_StartRxProcess(UserCallback))
  {
    retr = UTIL_TRACE_MNG_TRANSPORTERROR;
  }
  return retr;
}

/**
  * @brief  Allocate buffer inside the transport layer
  * @retval 1 if success else 0
  */
__WEAK UTIL_TRACE_MNG_Status_t UTIL_TRACE_MNG_TransportAllocateBuffer(uint16_t Size, uint8_t **pData,
                                                       uint16_t *FifoSize, uint16_t *WritePos)
{
  UTIL_TRACE_MNG_Status_t retr = UTIL_TRACE_MNG_TRANSPORTERROR;
  if (UTIL_ADV_TRACE_OK == UTIL_ADV_TRACE_ZCSend_Allocation(Size, pData, FifoSize, WritePos))
  {
    retr = UTIL_TRACE_MNG_OK;
  }
  return retr;
}

/**
  * @}
  */

/**
  * @addtogroup TRACE_MNG_private_function
  *  @{
  */

/**
  * @brief  calculate the space to store a data int8
  * @param  Value data value
  * @retval the size in bit
  */
static uint8_t TRACE_MNG_GetINT8Size(uint8_t Value)
{
  uint8_t size = 1;
  if ((Value == FOF) || (Value == ESC))
  {
    size++;
  }
  return size;
}

/**
  * @brief  calculate the space to store a data int16
  * @param  Value data value
  * @retval the size in bit
  */
static uint8_t TRACE_MNG_GetINT16Size(uint16_t Value)
{
  uint8_t size;
  size = TRACE_MNG_GetINT8Size((uint8_t)(Value & 0xFF));
  size += TRACE_MNG_GetINT8Size((uint8_t)((Value >> 8) & 0xFF));
  return size;
}

/**
  * @brief  calculate the space to store a data int32
  * @param  Value data value
  * @retval the size in bit
  */
static uint8_t TRACE_MNG_GetINT32Size(uint32_t Value)
{
  uint8_t size;
  size  = TRACE_MNG_GetINT8Size((uint8_t)(Value & 0xFF));
  size += TRACE_MNG_GetINT8Size((uint8_t)((Value >> 8) & 0xFF));
  size += TRACE_MNG_GetINT8Size((uint8_t)((Value >> 16) & 0xFF));
  size += TRACE_MNG_GetINT8Size((uint8_t)((Value >> 24) & 0xFF));
  return size;
}

/**
  * @brief  this function execute the command receive on the channel 0
  * @param  Data pointer on the data Value data value
  * @param Size data size
  */
static void TRACE_MNG_ExecuterCommand(uint8_t *Data, uint8_t Size)
{
  uint8_t tmpBuffer[22];
  uint8_t Appchannel = Data[1];
  uint8_t command = Data[0];
  TRACE_MNG_Command_t status = COMMAND_NAK;

  if (Size >= 1) /* Minimum size for a command */
  {
    switch (command)
    {
      case COMMAND_GETAPPCHANNELINFO:
      {
        if (TRACE_MNG_Ctx.ChannelCtx[Appchannel].ApplicationID != NULL)
        {
          TRACE_MNG_SendCommand(COMMAND_ACK, COMMAND_GETAPPCHANNELINFO, tmpBuffer,
                                /* the buffer used here should be 22-bit minmun */
                                TRACE_MNG_Format_ChannelInfo(Appchannel, tmpBuffer));
          status = COMMAND_NONE;
        }
        break;
      }
      case COMMAND_SETCHANNELVERBOSE:
      {
        if (((Appchannel == 0)
             ||
             ((Appchannel < TRACE_MNG_MAXCHANNEL) &&
              (TRACE_MNG_Ctx.ChannelCtx[Appchannel].ApplicationID != NULL) &&
              (TRACE_MNG_Ctx.ChannelCtx[Appchannel].ApplicationInfo.Data.State != TRACE_MNG_CHANNELSTATE_RESET))
            )
           )
        {
          TRACE_MNG_Ctx.ChannelCtx[Appchannel].ApplicationInfo.Command.State_Verbose = Data[2];
          status = COMMAND_ACK;
        }
        break;
      }
      case COMMAND_GETCHANNELINFO:
        tmpBuffer[0] = TRACE_MNG_Ctx.NumberOfRegisteredChannel;
        tmpBuffer[1] = UTIL_TRACE_MNG_MAXAPPLICATIONCHANNEL; /* number of channel available for the application */
        TRACE_MNG_SendCommand(COMMAND_ACK, COMMAND_GETCHANNELINFO, tmpBuffer, 2);
        status = COMMAND_NONE;
        break;
      default:
        break;
    }

    switch (status)
    {
      case COMMAND_NAK:
      case COMMAND_ACK:
        TRACE_MNG_SendCommand(status, command, NULL, 0);
        break;
      case COMMAND_NONE:
      default:
        break;
    }
  }
}

/**
  * @brief  this function is the channel 0 responder in charge to receive/treat the data for the channel 0
  * @param  Data data value
  * @param  Status based on @ref UTIL_TRACE_MNG_RxStatus_t
  */
static void TRACE_MNG_Channel0Responder(uint8_t Data, UTIL_TRACE_MNG_RxStatus_t Status)
{
  static uint8_t data[MAX_COMMAND_LENGTH];
  static uint8_t index = 0;

  switch (Status)
  {
    case TRACE_MNG_RXSTART:
      index = 0;
    break;
    case TRACE_MNG_RXADDDATA:
    {
      if (index < MAX_COMMAND_LENGTH)
      {
        data[index++] = Data;
      }
      break;
    }
    case TRACE_MNG_RXCOMPLETE:
    {
      /* execute the command */
      TRACE_MNG_ExecuterCommand(data, index);
      break;
    }
    case TRACE_MNG_RXSIZE:
      break;
    case TRACE_MNG_RXERROR:
    case TRACE_MNG_FRAMEERROR:
    default:
    {
      TRACE_MNG_SendCommand(COMMAND_NAK, 0, NULL, 0);
      index = 0;
      break;
    }
  }
}

/**
  * @brief  this function is the channel 0 responder in charge to receive/treat the data for the channel 0
  * @param  Data data value
  * @param status based on @ref UTIL_TRACE_MNG_RxStatus_t
  */
static void TRACE_MNG_SendCommand(uint8_t Command, uint8_t CommandOrigin, uint8_t *PtrData, uint8_t DSize)
{
  uint16_t size = 10; /* 2FOF + 4TS + channel 0 + command*/
  uint8_t *ptr;
  uint16_t fifosize;
  uint16_t writepos;

  if (CommandOrigin != 0)
  {
    /* size + 1 to add the origin command inside the frame */
    size += 1;
  }

