stm32-hotspot/X-CUBE-MATTER-Extension/Utilities/trace/manager/stm32_trace_mng.c
  for (uint8_t index = 0; index < DSize; index++)
  {
    size += TRACE_MNG_GetINT8Size(PtrData[index]);
  }

  /* Allocation of a buffer inside the trace system */
  if ((UTIL_TRACE_MNG_OK == UTIL_TRACE_MNG_TransportAllocateBuffer(size, &ptr, &fifosize, &writepos)) && (0 != fifosize))
  {
    /* Push FOF */
    TRACE_MNG_WDATAFOF();

    /* Write zero 7 zero : timeStamp (4) + channel 0 (1) + decoder 0 (2)*/
    for (uint8_t index = 0; index < 7; index++)
    {
      TRACE_MNG_WDATA(0x00u);
    }

    TRACE_MNG_WDATA(Command);
    if (CommandOrigin != 0)
    {
      TRACE_MNG_WDATA(CommandOrigin);
    }

    for (uint16_t index = 0; index < DSize; index++)
    {
      TRACE_MNG_WDATAINT8(PtrData[index]);
    }

    /* Push FOF */
    TRACE_MNG_WDATAFOF();

    /* Validate the data send */
    UTIL_ADV_TRACE_ZCSend_Finalize();
  }
}

/**
  * @brief  this function is the channel 0 responder in charge to receive/treat the data for the channel 0
  * @param  Channel the channel number
  * @param  PData pointer to store the data value
  * @retval data size
  */
static uint8_t TRACE_MNG_Format_ChannelInfo(uint8_t Channel, uint8_t *PData)
{
  /* channel info */
  PData[0] = Channel;

  /* Application ID */
  for (uint8_t datapos = 0; datapos < 4; datapos++)
  {
    PData[4 * datapos + 1] = TRACE_MNG_Ctx.ChannelCtx[Channel].ApplicationID[datapos] & 0xFF;
    PData[4 * datapos + 2] = (TRACE_MNG_Ctx.ChannelCtx[Channel].ApplicationID[datapos] >> 8) & 0xFF;
    PData[4 * datapos + 3] = (TRACE_MNG_Ctx.ChannelCtx[Channel].ApplicationID[datapos] >> 16) & 0xFF;
    PData[4 * datapos + 4] = (TRACE_MNG_Ctx.ChannelCtx[Channel].ApplicationID[datapos] >> 24) & 0xFF;
  }

  /* State_Verbose */
  PData[17] = TRACE_MNG_Ctx.ChannelCtx[Channel].ApplicationInfo.Command.State_Verbose;

  /* CoreInstance */
  PData[18] = TRACE_MNG_Ctx.ChannelCtx[Channel].ApplicationInfo.Command.Core_Instance;

  /* Version */
  PData[19] = TRACE_MNG_Ctx.ChannelCtx[Channel].ApplicationVersion & 0xFF;
  PData[20] = (TRACE_MNG_Ctx.ChannelCtx[Channel].ApplicationVersion >> 8) & 0xFF;

  /* channel state */
  return 21;
}

/**
  * @brief  this function manage the frame to send an overflow command
  * @param  PData pointer on the data frame
  * @param  Size pointer to get the size of the data
  */
static void TRACE_MNG_COMMANDOverFlow(uint8_t **PData, uint16_t *Size)
{
  static const uint8_t overflow_command[] = { FOF, 0x0, 0x0, 0x0, 0x0,
                                                   0x0,
                                                   0x0, 0x0,
                                                   COMMAND_OVERFLOW,
                                             FOF };
  *PData = (uint8_t *)overflow_command;
  *Size = sizeof(overflow_command);
}

/**
  * @brief  this function control if the trace could be sent
  * @param Channel the channel number
  * @param Verbose the verbose Level
  * @retval status based on 0/1 FALSE/TRUE
  */
static uint8_t TRACE_MNG_ControlTraceCondition(uint8_t Channel, uint8_t VerboseLevel)
{
  uint8_t retr = 0; /* FALSE condition */
  if (
    /* control of the channel number */
    (Channel > 0) && (Channel < TRACE_MNG_MAXCHANNEL) &&
    /* control if the channel 0 is enabled */
    (TRACE_MNG_Ctx.ChannelCtx[CHANNEL_CONTROL].ApplicationInfo.Data.State == TRACE_MNG_CHANNELSTATE_STATE_ENABLED) &&
    /* control if the app channel is enabled */
    (TRACE_MNG_Ctx.ChannelCtx[Channel].ApplicationInfo.Data.State == TRACE_MNG_CHANNELSTATE_STATE_ENABLED) &&
    /* control the verbose level of the app channel */
    (TRACE_MNG_Ctx.ChannelCtx[Channel].ApplicationInfo.Data.Verbose >= VerboseLevel))
  {
    retr = 1; /* TRUE condition */
  }
  return retr;
}

/**
  * @brief  this function manage the data reception
  * @param  pointer on data buffer
  * @param  size of the data buffer
  * @param  error code 0 : OK else error
  */
void TRACE_NMG_RXCallback(uint8_t *PData, uint16_t Size, uint8_t Error)
{
  static TRACE_MNG_RXStateMachine_t state = FRAME_WAIT_FOF;
  static uint8_t escape = 0;
  static uint8_t data_size = 0;

  /* Manage the RX callback reception */
  if (Error != 0)
  {
    /* Report an error to the current channel and discard reception machine */
    if (TRACE_MNG_Ctx.currentRXCallback != NULL)
    {
      TRACE_MNG_Ctx.currentRXCallback(0, TRACE_MNG_RXERROR);
    }
    /* wait for the next frame */
    state = FRAME_WAIT_FOF;
    escape = 0;
    TRACE_MNG_Ctx.currentRXCallback = NULL;
  }
  else
  {
    for (uint16_t index = 0; index < Size; index++)
    {
      if (PData[index] == FOF)
      {
        /* corresponds to 2 case the begin of a data or the end of data transfer */
        switch (state)
        {
          case FRAME_WAIT_FOF:
            state = FRAME_WAIT_CHANNEL;
            break;
          case FRAME_WAIT_END_FOF:
            /* Frame reception complete */
            if (TRACE_MNG_Ctx.currentRXCallback != NULL)
            {
              TRACE_MNG_Ctx.currentRXCallback(0, TRACE_MNG_RXCOMPLETE);
            }
            /* wait the nexframe */
            state = FRAME_WAIT_FOF;
            break;
          default:
            /* case when receiving an unexpected FOF, a frame error is reported */
            if (TRACE_MNG_Ctx.currentRXCallback != NULL)
            {
              TRACE_MNG_Ctx.currentRXCallback(0, TRACE_MNG_FRAMEERROR);
            }
            /* going to wait for channel if it is the beginning of a new frame */
            state = FRAME_WAIT_CHANNEL;
            break;
        }
        escape = 0;
        TRACE_MNG_Ctx.currentRXCallback = NULL;
      }
      else
      {
        /* corresponds to data reception */
        if ((PData[index] == ESC) && (escape == 0))
        {
          /* start sequence of replacement */
          escape = 1;
        }
        else
        {
          uint8_t data = PData[index];
          if (escape == 1)
          {
            escape = 0;
            switch (data)
            {
              case ESC_VAL:
                data = ESC;
                break;
              case FOF_VAL:
                data = FOF;
                break;
              default:
                if (TRACE_MNG_Ctx.currentRXCallback != NULL)
                {
                  TRACE_MNG_Ctx.currentRXCallback(data, TRACE_MNG_FRAMEERROR);
                }
                state = FRAME_WAIT_FOF;
                break;
            }
          }
          switch (state)
          {
            case FRAME_WAIT_CHANNEL:
            {
              TRACE_MNG_Ctx.currentRXCallback = TRACE_MNG_Ctx.ChannelCtx[data].RXCallback;
              if (NULL != TRACE_MNG_Ctx.currentRXCallback)
              {
                TRACE_MNG_Ctx.currentRXCallback(data, TRACE_MNG_RXSTART);
                state = FRAME_WAIT_DATA_SIZE;
              }
              else
              {
                /* the data are not store because there is no application to treat them */
                state = FRAME_WAIT_FOF;
              }
              break;
            }
            case FRAME_WAIT_DATA_SIZE:
            {
              data_size = data;
              TRACE_MNG_Ctx.currentRXCallback(data, TRACE_MNG_RXSIZE);
              state = FRAME_DATA_RECEPTION;
              break;
            }
            case FRAME_DATA_RECEPTION:
              data_size--;
              TRACE_MNG_Ctx.currentRXCallback(data, TRACE_MNG_RXADDDATA);
              if (data_size == 0)
              {
                state = FRAME_WAIT_END_FOF;
              }
              break;
            case FRAME_WAIT_END_FOF:
              TRACE_MNG_Ctx.currentRXCallback(data, TRACE_MNG_FRAMEERROR);
              state = FRAME_WAIT_FOF;
              break;
            default:
              break;
          }
        }
      }
    }
  }
}

/**
  * @brief read the time stamp
  * @retval the time stamp value in 32-bit
  */
__WEAK uint32_t UTIL_TRACE_MNG_GetTimeStamp(void)
{
  return 0;
}

/**
  * @}
  */

/**
  * @}
  */
